# 작업1유형

## Q1. 결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 그후 남은 데이터의 상위 70%에 해당하는 데이터만 남겨둔 후 median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라

In [141]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
df.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [142]:
df.shape

(20640, 10)

In [143]:
df = df.dropna()

In [144]:
df.shape

(18957, 10)

In [145]:
df.shape[0]*0.7

13269.9

In [146]:
df_upper70 = df.iloc[:int(df.shape[0]*0.7)]
round(df_upper70['median_income'].quantile(0.25),2)

2.51

## Q2. 1990년도는 해당년도 평균 이하 GDP를 가지지만, 2010년도에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라

In [147]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

In [148]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11507 entries, 0 to 11506
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  11507 non-null  object
 1   Country Code  11507 non-null  object
 2   Year          11507 non-null  int64
 3   Value         11507 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 359.7+ KB

In [149]:
df['Year_mean'] = df.groupby('Year',as_index=False)['Value'].transform('mean')
df['Year_mean']

0        1.167048e+07
1        1.287974e+07
2        1.352383e+07
3        1.473894e+07
4        1.698420e+07
             ...
11502    2.504404e+08
11503    2.584570e+08
11504    2.680941e+08
11505    2.531895e+08
11506    2.646396e+08
Name: Year_mean, Length: 11507, dtype: float64

In [150]:
lower = df [(df['Year'] == 1990) &  (df['Value'] <= df['Year_mean'])]['Country Name'].to_list()
upper = df [(df['Year'] == 2010) &  (df['Value'] >= df['Year_mean'])]['Country Name'].to_list()

In [151]:
len(set(lower) & set(upper))

5

## Q3. 데이터에서 결측치가 가장 많은 컬럼을 출력하라

In [152]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

In [153]:
df.isna().sum().idxmax()

'Fare'

# 작업 2유형

## Q4. 여행자 보험 가입여부 분류
종속 변수 : TravelInsurance , TravelInsurance가 1일 확률을 구해서 제출하라. 평가지표 : auc
제출 파일의 컬럼은 ID, proba 두개만 존재해야한다.

In [154]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_test_.csv')
train.head()

,ID,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,1008,26,Private Sector/Self Employed,Yes,1400000,5,0,No,Yes,1
1,199,30,Private Sector/Self Employed,No,1450000,5,0,Yes,Yes,1
2,86,32,Government Sector,Yes,900000,4,0,No,No,0
3,560,26,Private Sector/Self Employed,Yes,1400000,7,0,No,Yes,1
4,161,34,Private Sector/Self Employed,No,1400000,3,1,No,Yes,1

In [155]:
train['TravelInsurance']

0       1
1       1
2       0
3       1
4       1
       ..
1485    0
1486    0
1487    0
1488    0
1489    0
Name: TravelInsurance, Length: 1490, dtype: int64

In [156]:
train.shape, test.shape

((1490, 10), (497, 9))

In [157]:
train.isna().sum().sum(), test.isna().sum().sum()

(0, 0)

In [158]:
train.describe()

,ID,Age,AnnualIncome,FamilyMembers,ChronicDiseases,TravelInsurance
count,1490.000000,1490.000000,1.490000e+03,1490.000000,1490.000000,1490.000000
mean,994.842282,29.716779,9.320470e+05,4.761745,0.285235,0.356376
std,573.438070,2.931325,3.760655e+05,1.615161,0.451678,0.479089
min,0.000000,25.000000,3.000000e+05,2.000000,0.000000,0.000000
25%,509.500000,28.000000,6.000000e+05,4.000000,0.000000,0.000000
50%,997.500000,29.000000,9.000000e+05,5.000000,0.000000,0.000000
75%,1491.750000,32.000000,1.250000e+06,6.000000,1.000000,1.000000
max,1986.000000,35.000000,1.800000e+06,9.000000,1.000000,1.000000

In [159]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1490 entries, 0 to 1489
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   1490 non-null   int64
 1   Age                  1490 non-null   int64
 2   Employment Type      1490 non-null   object
 3   GraduateOrNot        1490 non-null   object
 4   AnnualIncome         1490 non-null   int64
 5   FamilyMembers        1490 non-null   int64
 6   ChronicDiseases      1490 non-null   int64
 7   FrequentFlyer        1490 non-null   object
 8   EverTravelledAbroad  1490 non-null   object
 9   TravelInsurance      1490 non-null   int64
dtypes: int64(6), object(4)
memory usage: 116.5+ KB

In [160]:
df = pd.concat([train,test],axis=0)
object_cols = df.select_dtypes(include="object").columns
object_cols

Index(['Employment Type', 'GraduateOrNot', 'FrequentFlyer',
       'EverTravelledAbroad'],
      dtype='object')

In [161]:
from sklearn.preprocessing import LabelEncoder
encoders={}

for col in object_cols:
    encoder = LabelEncoder()
    df[col] = encoder.fit_transform(df[col])
    encoders[col] = encoder

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1987 entries, 0 to 496
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   1987 non-null   int64
 1   Age                  1987 non-null   int64
 2   Employment Type      1987 non-null   int32
 3   GraduateOrNot        1987 non-null   int32
 4   AnnualIncome         1987 non-null   int64
 5   FamilyMembers        1987 non-null   int64
 6   ChronicDiseases      1987 non-null   int64
 7   FrequentFlyer        1987 non-null   int32
 8   EverTravelledAbroad  1987 non-null   int32
 9   TravelInsurance      1490 non-null   float64
dtypes: float64(1), int32(4), int64(5)
memory usage: 139.7 KB

In [162]:
n_train = len(train)
train_df = df.iloc[:n_train]
test_df = df.iloc[n_train:]

X = train_df.drop(['ID','TravelInsurance'], axis=1)
y = train_df['TravelInsurance']
X_test = test_df.drop(['ID','TravelInsurance'], axis=1)
X_test

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,31,0,1,1300000,4,0,0,0
1,33,0,1,800000,3,0,1,0
2,28,1,1,1150000,6,0,1,0
3,29,1,1,350000,3,0,0,0
4,28,0,1,600000,9,0,0,0
...,...,...,...,...,...,...,...,...
492,28,0,1,1100000,4,0,0,0
493,29,1,1,500000,4,0,0,0
494,31,1,1,1350000,3,0,0,1
495,32,0,1,900000,6,0,0,0
496,33,1,1,1500000,4,0,1,1

In [163]:
train['TravelInsurance'].value_counts()/len(train)

TravelInsurance
0    0.643624
1    0.356376
Name: count, dtype: float64

In [164]:
from sklearn.model_selection import train_test_split
X_train, X_valid, y_train, y_valid = train_test_split(X, y, test_size=0.2, random_state=42)

from sklearn.ensemble import RandomForestClassifier
model_rf = RandomForestClassifier(random_state=42)
model_rf.fit(X_train, y_train)
y_pred_proba_rf = model_rf.predict_proba(X_valid)[:,1]

from sklearn.metrics import roc_auc_score
score = roc_auc_score(y_valid, y_pred_proba_rf )
score

0.7696730610561056

In [165]:
y_pred_prob = model_rf.predict_proba(X_test)[:,1]
y_pred_prob

array([0.00533333, 0.27      , 0.116     , 0.234     , 0.25785714,
       0.98      , 0.025     , 0.        , 0.21883333, 0.97      ,
       0.0275    , 0.0225    , 0.2139697 , 0.99      , 0.15      ,
       0.075     , 0.57515079, 0.        , 0.21      , 0.51153968,
       0.05316667, 0.55      , 1.        , 0.01333333, 0.2365    ,
       0.0645    , 0.19      , 0.19816667, 0.34590476, 0.18166667,
       0.02      , 0.01      , 0.66      , 0.33846429, 0.125     ,
       0.78      , 0.97      , 0.64      , 0.36578571, 0.51153968,
       0.24190079, 0.7       , 0.07458333, 0.96666667, 0.2215    ,
       0.44033333, 0.15      , 0.03833333, 0.        , 0.39      ,
       1.        , 0.13266667, 0.03366667, 0.82441667, 0.0415    ,
       0.        , 0.0285    , 0.        , 0.31045238, 0.065     ,
       0.01      , 0.01583333, 0.03880952, 0.99      , 0.08666667,
       0.41490152, 0.66      , 0.4395    , 0.79      , 0.94      ,
       0.66266667, 0.43275   , 0.1225    , 0.48333333, 0.442     ,
       0.02083333, 0.64392857, 0.2915    , 0.98      , 0.        ,
       0.68166667, 0.442     , 1.        , 0.65      , 0.36      ,
       0.06      , 0.18      , 0.64392857, 0.32      , 0.05      ,
       0.12      , 0.52127976, 0.01816667, 0.00533333, 0.93      ,
       1.        , 0.885     , 0.05292857, 0.078     , 0.64      ,
       0.565     , 0.05      , 0.02      , 0.01      , 0.97      ,
       1.        , 0.46566667, 0.        , 0.3875    , 0.01333333,
       0.35447619, 0.35916667, 0.        , 0.06428571, 0.64483333,
       1.        , 0.94416667, 0.24666667, 0.16016667, 0.26666667,
       0.99      , 0.045     , 0.        , 0.47333333, 0.        ,
       0.99      , 0.30041667, 0.10833333, 0.68      , 0.2915    ,
       0.0065    , 0.3395    , 0.        , 0.12666667, 0.0375    ,
       0.99      , 0.067     , 0.1       , 0.22495238, 0.23733333,
       0.42128571, 0.99      , 0.46566667, 0.98      , 0.7575    ,
       0.31483333, 0.73333333, 0.22833333, 0.04316667, 0.04      ,
       0.23745743, 0.01333333, 0.93066667, 0.49169048, 0.11      ,
       1.        , 0.075     , 0.29266667, 0.4       , 0.28766667,
       0.07      , 0.02716667, 0.01      , 0.3705    , 0.        ,
       0.544     , 0.85      , 0.        , 0.265     , 0.02      ,
       0.03      , 0.309     , 0.96      , 0.135     , 0.03880952,
       0.        , 0.03      , 0.04816667, 0.47366667, 0.51833333,
       0.53428571, 0.97      , 0.3       , 0.2       , 0.7125    ,
       0.98      , 0.71842857, 0.895     , 0.427     , 0.44154762,
       0.        , 0.05571429, 0.07458333, 0.015     , 0.35      ,
       0.03266667, 0.01      , 0.53597619, 0.09533333, 0.15      ,
       0.1995    , 0.08416667, 0.11333333, 0.045     , 0.99      ,
       0.9       , 0.04766667, 0.40161905, 0.44287302, 0.53597619,
       1.        , 0.23488095, 0.004     , 0.63      , 0.1425    ,
       0.63666667, 0.94      , 0.09866667, 0.84166667, 0.26569048,
       0.01      , 0.15      , 0.16284171, 0.        , 0.49966667,
       0.02      , 0.1825    , 0.73833333, 1.        , 1.        ,
       0.16642857, 0.10833333, 0.23458333, 0.06166667, 0.92416667,
       0.20445238, 0.29      , 0.11166667, 0.01583333, 0.01      ,
       0.17905231, 0.95      , 0.56      , 0.025     , 0.309     ,
       0.036     , 0.94      , 0.06528571, 0.10345238, 0.3675    ,
       0.415     , 0.06283333, 0.32063059, 1.        , 1.        ,
       0.3225    , 0.99166667, 0.27833333, 0.17819048, 0.055     ,
       0.59      , 0.01333333, 0.05328571, 0.85      , 0.26      ,
       0.44287302, 0.01      , 0.0415    , 0.07      , 0.0065    ,
       0.985     , 0.99      , 0.77202381, 1.        , 0.15284199,
       0.27333333, 0.97      , 0.004     , 0.1485    , 0.0847619 ,
       0.10857143, 0.41490152, 0.67311905, 0.17483333, 0.99      ,
       0.00583333, 0.44287302, 0.        , 0.10369048, 0.30475   ,
       0.02716667, 0.        , 0.15284199, 0.02      , 0.23777381,
       0.0285    , 0.13190332, 0.775     , 0.38078571, 1.        ,
       0.01      , 0.03      , 0.305     , 0.70676587, 1.        ,
       1.        , 0.91666667, 0.        , 0.        , 0.98      ,
       0.234     , 0.43816667, 0.43816667, 0.809     , 0.25      ,
       0.4       , 0.50842857, 0.24      , 0.1365    , 0.699     ,
       0.02083333, 0.96      , 0.        , 0.14183333, 0.97      ,
       0.        , 0.875     , 0.64322222, 0.2139697 , 0.24      ,
       0.97      , 0.2215    , 0.28166667, 0.63910714, 0.94416667,
       1.        , 0.055     , 0.38333333, 0.        , 0.01      ,
       0.33166667, 0.15440476, 0.27      , 1.        , 0.81      ,
       0.98      , 0.22495238, 0.206     , 0.11352381, 0.02583333,
       0.43616667, 0.898     , 0.036     , 0.12203175, 0.47387302,
       0.06333333, 0.09      , 0.75333333, 0.95666667, 1.        ,
       1.        , 0.08      , 0.07883333, 0.05766667, 0.045     ,
       0.37495238, 0.07666667, 0.14816959, 0.        , 0.04083333,
       0.30333333, 0.24595238, 0.304     , 0.        , 0.01      ,
       0.15      , 0.14816959, 0.66883333, 0.0145    , 0.98      ,
       0.99166667, 0.004     , 0.11333333, 0.01333333, 0.1375    ,
       0.2387619 , 0.22040873, 0.        , 1.        , 0.32063059,
       0.24383333, 1.        , 0.015     , 0.03      , 0.16241667,
       0.0065    , 0.68      , 1.        , 0.0065    , 0.02      ,
       0.01816667, 0.35709524, 0.22      , 0.004     , 0.38      ,
       0.        , 0.02142857, 0.05      , 0.01583333, 0.98      ,
       0.084     , 0.50416667, 0.10416667, 0.499     , 0.84      ,
       0.23      , 0.77      , 0.21      , 0.499     , 0.885     ,
       0.51      , 0.88016667, 0.26012698, 0.97      , 0.045     ,
       0.2139697 , 0.37930952, 0.15284199, 0.05      , 0.70676587,
       0.09      , 0.99      , 0.03516667, 0.3295    , 0.8435    ,
       0.23      , 0.136     , 0.004     , 0.76166667, 0.92      ,
       0.047     , 0.048     , 0.255     , 0.50155159, 0.045     ,
       0.605     , 0.56492857, 0.22495238, 0.94      , 0.77702381,
       0.30166667, 1.        , 1.        , 0.06114286, 0.16284171,
       0.96      , 0.03083333, 0.38269481, 0.09      , 0.63910714,
       0.695     , 0.50842857, 0.98      , 0.02      , 0.18078571,
       0.        , 0.93      , 0.024     , 1.        , 0.03880952,
       1.        , 0.12      , 0.27761905, 0.042     , 0.15440476,
       0.0375    , 0.045     , 0.05292857, 0.11666667, 0.02433333,
       0.21      , 0.99      , 0.09428571, 0.51153968, 0.25513095,
       0.01      , 0.335     , 0.        , 0.69083333, 0.25716667,
       0.07139394, 0.24      , 0.12764286, 0.37930952, 1.        ,
       0.453     , 1.        ])

In [166]:
result = pd.DataFrame({
    "ID": test['ID'],
    "proba" : y_pred_prob
})

result

       ID     proba
0       6  0.005333
1       9  0.270000
2      20  0.116000
3      21  0.234000
4      23  0.257857
..    ...       ...
492  1964  0.127643
493  1970  0.379310
494  1973  1.000000
495  1976  0.453000
496  1982  1.000000

[497 rows x 2 columns]

In [167]:
result.to_csv('result5.csv', index=False)

test = pd.read_csv('result5.csv')
test

       ID     proba
0       6  0.005333
1       9  0.270000
2      20  0.116000
3      21  0.234000
4      23  0.257857
..    ...       ...
492  1964  0.127643
493  1970  0.379310
494  1973  1.000000
495  1976  0.453000
496  1982  1.000000

[497 rows x 2 columns]

# 작업3유형

## Q5. 다이어트약의 전후 체중 변화 기록이다. 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다. -3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다. 위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [168]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

       ID     투약전     투약후
0  user_1  55.137  56.106
1  user_2  66.584  60.409
2  user_3  52.259  50.639
3  user_4  77.081  69.164
4  user_5  62.677  57.622

## Q6. A등급에 해당하는 유저는 몇명인지 확인하라

In [169]:
import numpy as np
체중변화 = df['투약후']-df['투약전']
df['등급'] = np.where(체중변화<=-3, "A등급", np.where(체중변화<=0,"B등급","C등급"))
df

           ID     투약전     투약후   등급
0      user_1  55.137  56.106  C등급
1      user_2  66.584  60.409  A등급
2      user_3  52.259  50.639  B등급
3      user_4  77.081  69.164  A등급
4      user_5  62.677  57.622  A등급
..        ...     ...     ...  ...
230  user_231  78.041  81.021  C등급
231  user_232  77.187  68.417  A등급
232  user_233  50.640  51.139  C등급
233  user_234  58.133  49.653  A등급
234  user_235  55.422  55.179  B등급

[235 rows x 4 columns]

In [170]:
df[df['등급'] == "A등급"].shape[0]

121

In [171]:
df['체중변화'] = df['투약후']- df['투약전']
def groupby_filter(x):
    if x<= -3:
        return "A"
    elif x <=0:
        return "B"
    else:
        return "C"
    
df['groupby'] = df['체중변화'].apply(groupby_filter)
df

           ID     투약전     투약후   등급   체중변화 groupby
0      user_1  55.137  56.106  C등급  0.969       C
1      user_2  66.584  60.409  A등급 -6.175       A
2      user_3  52.259  50.639  B등급 -1.620       B
3      user_4  77.081  69.164  A등급 -7.917       A
4      user_5  62.677  57.622  A등급 -5.055       A
..        ...     ...     ...  ...    ...     ...
230  user_231  78.041  81.021  C등급  2.980       C
231  user_232  77.187  68.417  A등급 -8.770       A
232  user_233  50.640  51.139  C등급  0.499       C
233  user_234  58.133  49.653  A등급 -8.480       A
234  user_235  55.422  55.179  B등급 -0.243       B

[235 rows x 6 columns]

## Q7 카이제곱검정 통계량을 반올림하여 소숫점 이하 3째자리까지 구하여라

In [172]:
observed = df['등급'].value_counts().sort_index().to_list()
observed

[121, 67, 47]

In [173]:
expected_ratio = np.array([2,1,1])
expected = len(df) * expected_ratio/sum(expected_ratio)
expected

array([117.5 ,  58.75,  58.75])

In [175]:
from scipy.stats import  chisquare
chi2, p_value = chisquare(observed, expected )
round(chi2,3)

3.613

## Q7. 카이제곱 검정 p값을 반올림하여 소숫점 이하 3자리까지 구하고, 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)

In [176]:
round(p_value,3)

0.164

In [ ]:
"귀무가설" if round(p_value,3) >= 0.05 else "대립가설"
# 귀무가설: 투약 후 세 그룹의 비율이 이론 비율 2:1:1 과 "같다"
# 현 상태를 나타내는 것이 귀무가설

'귀무가설'

## Q8. 다이어트약의 전후 체중 변화 기록이다. A,B 공장에서 생산한 기계들의 rpm 값들을 기록한 데이터이다. 대응 표본 t 검정을 통해 B공장 제품들이 A 공장 제품들보다 rpm이 높다고 말할 수 있는지 검정하려한다

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

     rpm group
0  163.6     A
1  246.9     A
2  234.9     A
3  156.9     A
4  226.6     A

## A,B 공장 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)

In [183]:
df[df['group'] == "A"]

      rpm group
0   163.6     A
1   246.9     A
2   234.9     A
3   156.9     A
4   226.6     A
..    ...   ...
95  240.2     A
96  169.0     A
97  264.4     A
98  268.4     A
99  248.4     A

[100 rows x 2 columns]

In [185]:
from scipy.stats import shapiro

stat_a, p_value_a = shapiro(df[df['group'] == "A"]['rpm'])
stat_b, p_value_b = shapiro(df[df['group'] == "B"]['rpm'])
p_value_a, p_value_b

(0.3979080924239819, 0.9562843067714428)

In [ ]:
p_value_a > 0.05,  p_value_b> 0.05
# 정규분포를 따른다 (귀무가설 기각하지 못함, 귀무가설을 따름)

(True, True)

## Q9. A,B 공장 생산 제품의 rpm은 각각 분산이 동일한지 levene's 검정을 통해 확인하라. (pvalue 출력할 것)

In [189]:
from scipy.stats import levene

stat, p_value = levene(df[df['group'] == "A"]['rpm'], df[df['group'] == "B"]['rpm'])
round(p_value,3)

0.904

In [ ]:
round(p_value,3) > 0.05
# 귀무가설을 기각할 수 없다.
# 귀무가설: A와 B의 분산이 동일하다
# 두 그룹의 등분산성이 성립한다.

True

## 정규성을 만족하는 데이터를 다룰 때 Levene's Test 대신 Bartlett's Test를 사용할 수 있습니다.

In [191]:
from scipy.stats import bartlett

stat, p_value = bartlett(df[df['group'] == "A"]['rpm'], df[df['group'] == "B"]['rpm'])
round(p_value,3)

0.893

## Q10. 대응 표본 t 검정을 통해 B공장 제품들의 rpm이 A 공장 제품의 rpm보다 크다고 말할 수 있는지 검정하라. pvalue를 소숫점 이하 3자리까지 출력하고 귀무가설, 대립가설 중 하나를 출력하라*

In [208]:
대립가설 = "대립가설 : B공장 rpm > A공장 rpm"
귀무가설 = "귀무가설 : B공장 rpm <= A공장 rpm"
from scipy.stats import ttest_rel

stat, p_value = ttest_rel(df[df['group'] == "B"]['rpm'], df[df['group'] == "A"]['rpm'], alternative="greater")
round(p_value,3)

0.009

In [209]:
귀무가설 if round(p_value,3) > 0.05 else 대립가설

'대립가설 : B공장 rpm > A공장 rpm'